{"translation-revision-date":"2025-03-04 08:50+0000","generator":"WP-CLI\/2.8.1","source":"gutenberg-block\/src\/edit.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"th","plural-forms":"nplurals=1; plural=0;"}," Add new table":["เพิ่มตารางใหม่"]," Add\/Edit products to list":["เพิ่ม\/แก้ไขสินค้าลงในรายการ"]," Edit table":["แก้ไขตาราง"]," Search for product(s) without ASIN":["ค้นหาผลิตภัณฑ์ที่ไม่มี ASIN"],"-- Choose table data --":["-- เลือกข้อมูลตาราง --"],"-- Select from list --":["-- เลือกจากรายการ --"],"Add a few products and describe them briefly.":["เพิ่มผลิตภัณฑ์เล็กน้อยและอธิบายโดยย่อ"],"Add a single product with detailed description.":["เพิ่มผลิตภัณฑ์รายการเดียวพร้อมคำอธิบายโดยละเอียด"],"Add multiple similar products and compare them.":["เพิ่มผลิตภัณฑ์ที่คล้ายกันหลายรายการและเปรียบเทียบกัน"],"ASIN":["ASIN"],"Automatically based on best-sellers":["ขึ้นอยู่กับสินค้าขายดีโดยอัตโนมัติ"],"Buy button":["ปุ่มซื้อ"],"Buy button overwrite enabled?":["เปิดใช้งานการเขียนทับปุ่มซื้อหรือไม่?"],"Buy button text":["ข้อความของปุ่มซื้อ"],"Choose how the product block will look like in your post":["เลือกว่าบล็อกผลิตภัณฑ์จะมีลักษณะอย่างไรในโพสต์ของคุณ"],"Coming soon":["เร็วๆ นี้"],"Comparison Table":["ตารางเปรียบเทียบ"],"Connect Now":["เชื่อมต่อตอนนี้"],"Connect Your Amazon Partnership Account":["เชื่อมต่อบัญชีพันธมิตร Amazon ของคุณ"],"Count of items to show in list.":["จำนวนรายการที่จะแสดงในรายการ"],"Count of list items in product description.":["จำนวนรายการในคำอธิบายผลิตภัณฑ์"],"Custom product title.":["ชื่อผลิตภัณฑ์ที่กำหนดเอง"],"Description":["คำอธิบาย"],"Description enabled?":["เปิดใช้งานคำอธิบายแล้วหรือยัง?"],"Description Items":["คำอธิบายรายการ"],"Description length":["ความยาวคำอธิบาย"],"Description overwrite enabled?":["เปิดใช้งานการเขียนทับคำอธิบายหรือไม่"],"Display Bestseller #":["แสดงสินค้าขายดี #"],"Enter ASIN here...":["ป้อน ASIN ที่นี่..."],"General Settings":["การตั้งค่าทั่วไป"],"Horizontal cards":["การ์ดแนวนอน"],"Items to show":["รายการที่จะแสดง"],"Keywords":["คีย์เวิร์ด"],"Layout":["เค้าโครง"],"List with description":["รายการพร้อมคำอธิบาย"],"Lists":["รายการ"],"Maximum count of characters for each product description list item.":["จำนวนอักขระสูงสุดสำหรับแต่ละรายการคำอธิบายผลิตภัณฑ์"],"Maximum count of characters for the product title.":["จำนวนอักขระสูงสุดสำหรับชื่อผลิตภัณฑ์"],"Multiple Product List":["รายการผลิตภัณฑ์หลายรายการ"],"OR":["หรือ"],"Overwrite product description":["เขียนทับคำอธิบายผลิตภัณฑ์"],"Overwrite product description?":["เขียนทับคำอธิบายผลิตภัณฑ์?"],"Overwrite product title?":["เขียนทับชื่อผลิตภัณฑ์หรือไม่?"],"Search for the product in Amazon":["ค้นหาผลิตภัณฑ์ใน Amazon"],"Select":["เลือก"],"Select A Display Type":["เลือกประเภทการแสดงผล"],"Select How To Display Products":["เลือกวิธีการแสดงผลิตภัณฑ์"],"Show product description?":["แสดงคำอธิบายสินค้า?"],"Simplified list":["รายการแบบย่อ"],"Single Product Card":["การ์ดผลิตภัณฑ์เดี่ยว"],"Table Configuration":["การกำหนดค่าตาราง"],"Table data":["ข้อมูลตาราง"],"Templates and Styles":["เทมเพลตและสไตล์"],"The block you are attempting to use is currently not supported in the Site Editor. We apologize for any inconvenience this may cause. Our team is actively working to enhance compatibility, and we appreciate your understanding. For the best editing experience, please consider using post\/page editor or await future updates.":["บล็อกที่คุณพยายามใช้ไม่รองรับ Site Editor ในขณะนี้ เราขออภัยในความไม่สะดวกที่อาจเกิดขึ้น ทีมงานของเรากำลังตั้งใจทำงานเพื่อปรับปรุงความเข้ากันได้นี้ และขอขอบคุณที่คุณให้ความเข้าใจ เพื่อประสบการณ์การแก้ไขที่ดีที่สุด โปรดพิจารณาใช้ตัวแก้ไขโพสต์\/หน้า หรือรอการอัปเดตในอนาคต"],"This block is not supported while using Site Editor":["บล็อกนี้ไม่ได้รับการสนับสนุนในขณะที่ใช้ Site Editor"],"Title":["ชื่อเรื่อง"],"Title length":["ความยาวชื่อเรื่อง"],"Title overwrite enabled?":["เปิดใช้การเขียนทับชื่อหรือไม่?"],"To gain full access to this block, you need to connect your Amazon Partnership account.":["หากต้องการเข้าถึงบล็อคนี้อย่างเต็มรูปแบบ คุณต้องเชื่อมต่อบัญชี Amazon Partnership ของคุณ"],"Welcome, %s!":["ยินดีต้อนรับ %s!"]}}}